{"weightsManifest": [{"weights": [{"name": "block1_conv1/kernel", "shape": [3, 3, 3, 64], "dtype": "float32"}, {"name": "block1_conv1/bias", "shape": [64], "dtype": "float32"}], "paths": ["group1-shard1of1"]}, {"weights": [{"name": "block1_conv2/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "block1_conv2/bias", "shape": [64], "dtype": "float32"}], "paths": ["group2-shard1of1"]}, {"weights": [{"name": "block2_conv1/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "block2_conv1/bias", "shape": [128], "dtype": "float32"}], "paths": ["group3-shard1of1"]}, {"weights": [{"name": "block2_conv2/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "block2_conv2/bias", "shape": [128], "dtype": "float32"}], "paths": ["group4-shard1of1"]}, {"weights": [{"name": "block3_conv1/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "block3_conv1/bias", "shape": [256], "dtype": "float32"}], "paths": ["group5-shard1of1"]}, {"weights": [{"name": "block3_conv2/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "block3_conv2/bias", "shape": [256], "dtype": "float32"}], "paths": ["group6-shard1of1"]}, {"weights": [{"name": "block3_conv3/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "block3_conv3/bias", "shape": [256], "dtype": "float32"}], "paths": ["group7-shard1of1"]}, {"weights": [{"name": "block4_conv1/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "block4_conv1/bias", "shape": [512], "dtype": "float32"}], "paths": ["group8-shard1of2", "group8-shard2of2"]}, {"weights": [{"name": "block4_conv2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block4_conv2/bias", "shape": [512], "dtype": "float32"}], "paths": ["group9-shard1of3", "group9-shard2of3", "group9-shard3of3"]}, {"weights": [{"name": "block4_conv3/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block4_conv3/bias", "shape": [512], "dtype": "float32"}], "paths": ["group10-shard1of3", "group10-shard2of3", "group10-shard3of3"]}, {"weights": [{"name": "block5_conv1/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block5_conv1/bias", "shape": [512], "dtype": "float32"}], "paths": ["group11-shard1of3", "group11-shard2of3", "group11-shard3of3"]}, {"weights": [{"name": "block5_conv2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block5_conv2/bias", "shape": [512], "dtype": "float32"}], "paths": ["group12-shard1of3", "group12-shard2of3", "group12-shard3of3"]}, {"weights": [{"name": "block5_conv3/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block5_conv3/bias", "shape": [512], "dtype": "float32"}], "paths": ["group13-shard1of3", "group13-shard2of3", "group13-shard3of3"]}, {"weights": [{"name": "fc1/kernel", "shape": [25088, 4096], "dtype": "float32"}, {"name": "fc1/bias", "shape": [4096], "dtype": "float32"}], "paths": ["group14-shard1of99", "group14-shard2of99", "group14-shard3of99", "group14-shard4of99", "group14-shard5of99", "group14-shard6of99", "group14-shard7of99", "group14-shard8of99", "group14-shard9of99", "group14-shard10of99", "group14-shard11of99", "group14-shard12of99", "group14-shard13of99", "group14-shard14of99", "group14-shard15of99", "group14-shard16of99", "group14-shard17of99", "group14-shard18of99", "group14-shard19of99", "group14-shard20of99", "group14-shard21of99", "group14-shard22of99", "group14-shard23of99", "group14-shard24of99", "group14-shard25of99", "group14-shard26of99", "group14-shard27of99", "group14-shard28of99", "group14-shard29of99", "group14-shard30of99", "group14-shard31of99", "group14-shard32of99", "group14-shard33of99", "group14-shard34of99", "group14-shard35of99", "group14-shard36of99", "group14-shard37of99", "group14-shard38of99", "group14-shard39of99", "group14-shard40of99", "group14-shard41of99", "group14-shard42of99", "group14-shard43of99", "group14-shard44of99", "group14-shard45of99", "group14-shard46of99", "group14-shard47of99", "group14-shard48of99", "group14-shard49of99", "group14-shard50of99", "group14-shard51of99", "group14-shard52of99", "group14-shard53of99", "group14-shard54of99", "group14-shard55of99", "group14-shard56of99", "group14-shard57of99", "group14-shard58of99", "group14-shard59of99", "group14-shard60of99", "group14-shard61of99", "group14-shard62of99", "group14-shard63of99", "group14-shard64of99", "group14-shard65of99", "group14-shard66of99", "group14-shard67of99", "group14-shard68of99", "group14-shard69of99", "group14-shard70of99", "group14-shard71of99", "group14-shard72of99", "group14-shard73of99", "group14-shard74of99", "group14-shard75of99", "group14-shard76of99", "group14-shard77of99", "group14-shard78of99", "group14-shard79of99", "group14-shard80of99", "group14-shard81of99", "group14-shard82of99", "group14-shard83of99", "group14-shard84of99", "group14-shard85of99", "group14-shard86of99", "group14-shard87of99", "group14-shard88of99", "group14-shard89of99", "group14-shard90of99", "group14-shard91of99", "group14-shard92of99", "group14-shard93of99", "group14-shard94of99", "group14-shard95of99", "group14-shard96of99", "group14-shard97of99", "group14-shard98of99", "group14-shard99of99"]}, {"weights": [{"name": "fc2/kernel", "shape": [4096, 4096], "dtype": "float32"}, {"name": "fc2/bias", "shape": [4096], "dtype": "float32"}], "paths": ["group15-shard1of17", "group15-shard2of17", "group15-shard3of17", "group15-shard4of17", "group15-shard5of17", "group15-shard6of17", "group15-shard7of17", "group15-shard8of17", "group15-shard9of17", "group15-shard10of17", "group15-shard11of17", "group15-shard12of17", "group15-shard13of17", "group15-shard14of17", "group15-shard15of17", "group15-shard16of17", "group15-shard17of17"]}, {"weights": [{"name": "predictions/kernel", "shape": [4096, 1000], "dtype": "float32"}, {"name": "predictions/bias", "shape": [1000], "dtype": "float32"}], "paths": ["group16-shard1of4", "group16-shard2of4", "group16-shard3of4", "group16-shard4of4"]}], "modelTopology": {"keras_version": "2.1.4", "model_config": {"class_name": "Model", "config": {"name": "vgg16", "output_layers": [["predictions", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"name": "input_1", "batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "block1_conv1", "config": {"filters": 64, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "name": "block1_conv1", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same"}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block1_conv2", "config": {"filters": 64, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "name": "block1_conv2", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same"}, "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block1_pool", "config": {"name": "block1_pool", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "padding": "valid"}, "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block2_conv1", "config": {"filters": 128, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "name": "block2_conv1", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same"}, "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block2_conv2", "config": {"filters": 128, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "name": "block2_conv2", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same"}, "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block2_pool", "config": {"name": "block2_pool", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "padding": "valid"}, "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block3_conv1", "config": {"filters": 256, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "name": "block3_conv1", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same"}, "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block3_conv2", "config": {"filters": 256, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "name": "block3_conv2", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same"}, "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block3_conv3", "config": {"filters": 256, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "name": "block3_conv3", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same"}, "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block3_pool", "config": {"name": "block3_pool", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "padding": "valid"}, "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block4_conv1", "config": {"filters": 512, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "name": "block4_conv1", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same"}, "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block4_conv2", "config": {"filters": 512, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "name": "block4_conv2", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same"}, "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block4_conv3", "config": {"filters": 512, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "name": "block4_conv3", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same"}, "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block4_pool", "config": {"name": "block4_pool", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "padding": "valid"}, "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block5_conv1", "config": {"filters": 512, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "name": "block5_conv1", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same"}, "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block5_conv2", "config": {"filters": 512, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "name": "block5_conv2", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same"}, "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block5_conv3", "config": {"filters": 512, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "name": "block5_conv3", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same"}, "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block5_pool", "config": {"name": "block5_pool", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "padding": "valid"}, "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten", "config": {"trainable": true, "name": "flatten"}, "inbound_nodes": [[["block5_pool", 0, 0, {}]]]}, {"class_name": "Dense", "name": "fc1", "config": {"kernel_regularizer": null, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "name": "fc1", "units": 4096, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"class_name": "Dense", "name": "fc2", "config": {"kernel_regularizer": null, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "name": "fc2", "units": 4096, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["fc1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "predictions", "config": {"kernel_regularizer": null, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "name": "predictions", "units": 1000, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["fc2", 0, 0, {}]]]}]}}, "backend": "tensorflow"}}