{"modelTopology": {"backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, 224, 224, 3], "sparse": false}, "name": "input_1", "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]], "name": "conv1_pad"}, "name": "conv1_pad", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3, 3], "strides": [2, 2], "kernel_regularizer": null, "padding": "valid", "bias_regularizer": null, "use_bias": false, "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1]}, "name": "conv1", "inbound_nodes": [[["conv1_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "conv1_bn", "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "scale": true, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv1_bn", "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv1_relu"}, "name": "conv1_relu", "inbound_nodes": [[["conv1_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]], "name": "conv_pad_1"}, "name": "conv_pad_1", "inbound_nodes": [[["conv1_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"activation": "linear", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_1", "depth_multiplier": 1, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": false, "padding": "valid", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "depthwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "dilation_rate": [1, 1]}, "name": "conv_dw_1", "inbound_nodes": [[["conv_pad_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "conv_dw_1_bn", "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "scale": true, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_1_bn", "inbound_nodes": [[["conv_dw_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_1_relu"}, "name": "conv_dw_1_relu", "inbound_nodes": [[["conv_dw_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [1, 1], "strides": [1, 1], "kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "use_bias": false, "filters": 64, "kernel_constraint": null, "dilation_rate": [1, 1]}, "name": "conv_pw_1", "inbound_nodes": [[["conv_dw_1_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "conv_pw_1_bn", "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "scale": true, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_pw_1_bn", "inbound_nodes": [[["conv_pw_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_1_relu"}, "name": "conv_pw_1_relu", "inbound_nodes": [[["conv_pw_1_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]], "name": "conv_pad_2"}, "name": "conv_pad_2", "inbound_nodes": [[["conv_pw_1_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"activation": "linear", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_2", "depth_multiplier": 1, "kernel_size": [3, 3], "strides": [2, 2], "use_bias": false, "padding": "valid", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "depthwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "dilation_rate": [1, 1]}, "name": "conv_dw_2", "inbound_nodes": [[["conv_pad_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "conv_dw_2_bn", "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "scale": true, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_2_bn", "inbound_nodes": [[["conv_dw_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_2_relu"}, "name": "conv_dw_2_relu", "inbound_nodes": [[["conv_dw_2_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [1, 1], "strides": [1, 1], "kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "use_bias": false, "filters": 128, "kernel_constraint": null, "dilation_rate": [1, 1]}, "name": "conv_pw_2", "inbound_nodes": [[["conv_dw_2_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "conv_pw_2_bn", "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "scale": true, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_pw_2_bn", "inbound_nodes": [[["conv_pw_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_2_relu"}, "name": "conv_pw_2_relu", "inbound_nodes": [[["conv_pw_2_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]], "name": "conv_pad_3"}, "name": "conv_pad_3", "inbound_nodes": [[["conv_pw_2_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"activation": "linear", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_3", "depth_multiplier": 1, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": false, "padding": "valid", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "depthwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "dilation_rate": [1, 1]}, "name": "conv_dw_3", "inbound_nodes": [[["conv_pad_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "conv_dw_3_bn", "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "scale": true, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_3_bn", "inbound_nodes": [[["conv_dw_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_3_relu"}, "name": "conv_dw_3_relu", "inbound_nodes": [[["conv_dw_3_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [1, 1], "strides": [1, 1], "kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "use_bias": false, "filters": 128, "kernel_constraint": null, "dilation_rate": [1, 1]}, "name": "conv_pw_3", "inbound_nodes": [[["conv_dw_3_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "conv_pw_3_bn", "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "scale": true, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_pw_3_bn", "inbound_nodes": [[["conv_pw_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_3_relu"}, "name": "conv_pw_3_relu", "inbound_nodes": [[["conv_pw_3_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]], "name": "conv_pad_4"}, "name": "conv_pad_4", "inbound_nodes": [[["conv_pw_3_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"activation": "linear", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_4", "depth_multiplier": 1, "kernel_size": [3, 3], "strides": [2, 2], "use_bias": false, "padding": "valid", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "depthwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "dilation_rate": [1, 1]}, "name": "conv_dw_4", "inbound_nodes": [[["conv_pad_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "conv_dw_4_bn", "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "scale": true, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_4_bn", "inbound_nodes": [[["conv_dw_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_4_relu"}, "name": "conv_dw_4_relu", "inbound_nodes": [[["conv_dw_4_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [1, 1], "strides": [1, 1], "kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "use_bias": false, "filters": 256, "kernel_constraint": null, "dilation_rate": [1, 1]}, "name": "conv_pw_4", "inbound_nodes": [[["conv_dw_4_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "conv_pw_4_bn", "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "scale": true, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_pw_4_bn", "inbound_nodes": [[["conv_pw_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_4_relu"}, "name": "conv_pw_4_relu", "inbound_nodes": [[["conv_pw_4_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]], "name": "conv_pad_5"}, "name": "conv_pad_5", "inbound_nodes": [[["conv_pw_4_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"activation": "linear", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_5", "depth_multiplier": 1, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": false, "padding": "valid", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "depthwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "dilation_rate": [1, 1]}, "name": "conv_dw_5", "inbound_nodes": [[["conv_pad_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "conv_dw_5_bn", "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "scale": true, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_5_bn", "inbound_nodes": [[["conv_dw_5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_5_relu"}, "name": "conv_dw_5_relu", "inbound_nodes": [[["conv_dw_5_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [1, 1], "strides": [1, 1], "kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "use_bias": false, "filters": 256, "kernel_constraint": null, "dilation_rate": [1, 1]}, "name": "conv_pw_5", "inbound_nodes": [[["conv_dw_5_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "conv_pw_5_bn", "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "scale": true, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_pw_5_bn", "inbound_nodes": [[["conv_pw_5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_5_relu"}, "name": "conv_pw_5_relu", "inbound_nodes": [[["conv_pw_5_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]], "name": "conv_pad_6"}, "name": "conv_pad_6", "inbound_nodes": [[["conv_pw_5_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"activation": "linear", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_6", "depth_multiplier": 1, "kernel_size": [3, 3], "strides": [2, 2], "use_bias": false, "padding": "valid", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "depthwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "dilation_rate": [1, 1]}, "name": "conv_dw_6", "inbound_nodes": [[["conv_pad_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "conv_dw_6_bn", "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "scale": true, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_6_bn", "inbound_nodes": [[["conv_dw_6", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_6_relu"}, "name": "conv_dw_6_relu", "inbound_nodes": [[["conv_dw_6_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_6", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [1, 1], "strides": [1, 1], "kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "use_bias": false, "filters": 512, "kernel_constraint": null, "dilation_rate": [1, 1]}, "name": "conv_pw_6", "inbound_nodes": [[["conv_dw_6_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "conv_pw_6_bn", "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "scale": true, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_pw_6_bn", "inbound_nodes": [[["conv_pw_6", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_6_relu"}, "name": "conv_pw_6_relu", "inbound_nodes": [[["conv_pw_6_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]], "name": "conv_pad_7"}, "name": "conv_pad_7", "inbound_nodes": [[["conv_pw_6_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"activation": "linear", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_7", "depth_multiplier": 1, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": false, "padding": "valid", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "depthwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "dilation_rate": [1, 1]}, "name": "conv_dw_7", "inbound_nodes": [[["conv_pad_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "conv_dw_7_bn", "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "scale": true, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_7_bn", "inbound_nodes": [[["conv_dw_7", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_7_relu"}, "name": "conv_dw_7_relu", "inbound_nodes": [[["conv_dw_7_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_7", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [1, 1], "strides": [1, 1], "kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "use_bias": false, "filters": 512, "kernel_constraint": null, "dilation_rate": [1, 1]}, "name": "conv_pw_7", "inbound_nodes": [[["conv_dw_7_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "conv_pw_7_bn", "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "scale": true, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_pw_7_bn", "inbound_nodes": [[["conv_pw_7", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_7_relu"}, "name": "conv_pw_7_relu", "inbound_nodes": [[["conv_pw_7_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]], "name": "conv_pad_8"}, "name": "conv_pad_8", "inbound_nodes": [[["conv_pw_7_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"activation": "linear", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_8", "depth_multiplier": 1, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": false, "padding": "valid", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "depthwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "dilation_rate": [1, 1]}, "name": "conv_dw_8", "inbound_nodes": [[["conv_pad_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "conv_dw_8_bn", "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "scale": true, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_8_bn", "inbound_nodes": [[["conv_dw_8", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_8_relu"}, "name": "conv_dw_8_relu", "inbound_nodes": [[["conv_dw_8_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_8", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [1, 1], "strides": [1, 1], "kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "use_bias": false, "filters": 512, "kernel_constraint": null, "dilation_rate": [1, 1]}, "name": "conv_pw_8", "inbound_nodes": [[["conv_dw_8_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "conv_pw_8_bn", "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "scale": true, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_pw_8_bn", "inbound_nodes": [[["conv_pw_8", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_8_relu"}, "name": "conv_pw_8_relu", "inbound_nodes": [[["conv_pw_8_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]], "name": "conv_pad_9"}, "name": "conv_pad_9", "inbound_nodes": [[["conv_pw_8_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"activation": "linear", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_9", "depth_multiplier": 1, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": false, "padding": "valid", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "depthwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "dilation_rate": [1, 1]}, "name": "conv_dw_9", "inbound_nodes": [[["conv_pad_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "conv_dw_9_bn", "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "scale": true, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_9_bn", "inbound_nodes": [[["conv_dw_9", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_9_relu"}, "name": "conv_dw_9_relu", "inbound_nodes": [[["conv_dw_9_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_9", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [1, 1], "strides": [1, 1], "kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "use_bias": false, "filters": 512, "kernel_constraint": null, "dilation_rate": [1, 1]}, "name": "conv_pw_9", "inbound_nodes": [[["conv_dw_9_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "conv_pw_9_bn", "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "scale": true, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_pw_9_bn", "inbound_nodes": [[["conv_pw_9", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_9_relu"}, "name": "conv_pw_9_relu", "inbound_nodes": [[["conv_pw_9_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]], "name": "conv_pad_10"}, "name": "conv_pad_10", "inbound_nodes": [[["conv_pw_9_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"activation": "linear", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_10", "depth_multiplier": 1, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": false, "padding": "valid", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "depthwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "dilation_rate": [1, 1]}, "name": "conv_dw_10", "inbound_nodes": [[["conv_pad_10", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "conv_dw_10_bn", "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "scale": true, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_10_bn", "inbound_nodes": [[["conv_dw_10", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_10_relu"}, "name": "conv_dw_10_relu", "inbound_nodes": [[["conv_dw_10_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_10", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [1, 1], "strides": [1, 1], "kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "use_bias": false, "filters": 512, "kernel_constraint": null, "dilation_rate": [1, 1]}, "name": "conv_pw_10", "inbound_nodes": [[["conv_dw_10_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "conv_pw_10_bn", "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "scale": true, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_pw_10_bn", "inbound_nodes": [[["conv_pw_10", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_10_relu"}, "name": "conv_pw_10_relu", "inbound_nodes": [[["conv_pw_10_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]], "name": "conv_pad_11"}, "name": "conv_pad_11", "inbound_nodes": [[["conv_pw_10_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"activation": "linear", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_11", "depth_multiplier": 1, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": false, "padding": "valid", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "depthwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "dilation_rate": [1, 1]}, "name": "conv_dw_11", "inbound_nodes": [[["conv_pad_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "conv_dw_11_bn", "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "scale": true, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_11_bn", "inbound_nodes": [[["conv_dw_11", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_11_relu"}, "name": "conv_dw_11_relu", "inbound_nodes": [[["conv_dw_11_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_11", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [1, 1], "strides": [1, 1], "kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "use_bias": false, "filters": 512, "kernel_constraint": null, "dilation_rate": [1, 1]}, "name": "conv_pw_11", "inbound_nodes": [[["conv_dw_11_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "conv_pw_11_bn", "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "scale": true, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_pw_11_bn", "inbound_nodes": [[["conv_pw_11", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_11_relu"}, "name": "conv_pw_11_relu", "inbound_nodes": [[["conv_pw_11_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]], "name": "conv_pad_12"}, "name": "conv_pad_12", "inbound_nodes": [[["conv_pw_11_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"activation": "linear", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_12", "depth_multiplier": 1, "kernel_size": [3, 3], "strides": [2, 2], "use_bias": false, "padding": "valid", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "depthwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "dilation_rate": [1, 1]}, "name": "conv_dw_12", "inbound_nodes": [[["conv_pad_12", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "conv_dw_12_bn", "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "scale": true, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_12_bn", "inbound_nodes": [[["conv_dw_12", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_12_relu"}, "name": "conv_dw_12_relu", "inbound_nodes": [[["conv_dw_12_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_12", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [1, 1], "strides": [1, 1], "kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "use_bias": false, "filters": 1024, "kernel_constraint": null, "dilation_rate": [1, 1]}, "name": "conv_pw_12", "inbound_nodes": [[["conv_dw_12_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "conv_pw_12_bn", "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "scale": true, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_pw_12_bn", "inbound_nodes": [[["conv_pw_12", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_12_relu"}, "name": "conv_pw_12_relu", "inbound_nodes": [[["conv_pw_12_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]], "name": "conv_pad_13"}, "name": "conv_pad_13", "inbound_nodes": [[["conv_pw_12_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"activation": "linear", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_13", "depth_multiplier": 1, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": false, "padding": "valid", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "depthwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "dilation_rate": [1, 1]}, "name": "conv_dw_13", "inbound_nodes": [[["conv_pad_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "conv_dw_13_bn", "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "scale": true, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_13_bn", "inbound_nodes": [[["conv_dw_13", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_13_relu"}, "name": "conv_dw_13_relu", "inbound_nodes": [[["conv_dw_13_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_13", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [1, 1], "strides": [1, 1], "kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "use_bias": false, "filters": 1024, "kernel_constraint": null, "dilation_rate": [1, 1]}, "name": "conv_pw_13", "inbound_nodes": [[["conv_dw_13_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "conv_pw_13_bn", "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "scale": true, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_pw_13_bn", "inbound_nodes": [[["conv_pw_13", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_13_relu"}, "name": "conv_pw_13_relu", "inbound_nodes": [[["conv_pw_13_bn", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"data_format": "channels_last", "trainable": true, "name": "global_average_pooling2d_1"}, "name": "global_average_pooling2d_1", "inbound_nodes": [[["conv_pw_13_relu", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1024], "trainable": true, "name": "reshape_1"}, "name": "reshape_1", "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "trainable": true, "name": "dropout", "rate": 0.001}, "name": "dropout", "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_preds", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [1, 1], "strides": [1, 1], "kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "use_bias": true, "filters": 1000, "kernel_constraint": null, "dilation_rate": [1, 1]}, "name": "conv_preds", "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "act_softmax"}, "name": "act_softmax", "inbound_nodes": [[["conv_preds", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"target_shape": [1000], "trainable": true, "name": "reshape_2"}, "name": "reshape_2", "inbound_nodes": [[["act_softmax", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["reshape_2", 0, 0]], "name": "mobilenet_1.00_224"}}, "keras_version": "2.1.6"}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"dtype": "float32", "name": "conv1/kernel", "shape": [3, 3, 3, 32]}]}, {"paths": ["group2-shard1of1"], "weights": [{"dtype": "float32", "name": "conv1_bn/gamma", "shape": [32]}, {"dtype": "float32", "name": "conv1_bn/beta", "shape": [32]}, {"dtype": "float32", "name": "conv1_bn/moving_mean", "shape": [32]}, {"dtype": "float32", "name": "conv1_bn/moving_variance", "shape": [32]}]}, {"paths": ["group3-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_1/depthwise_kernel", "shape": [3, 3, 32, 1]}]}, {"paths": ["group4-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_10/depthwise_kernel", "shape": [3, 3, 512, 1]}]}, {"paths": ["group5-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_10_bn/gamma", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_10_bn/beta", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_10_bn/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_10_bn/moving_variance", "shape": [512]}]}, {"paths": ["group6-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_11/depthwise_kernel", "shape": [3, 3, 512, 1]}]}, {"paths": ["group7-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_11_bn/gamma", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_11_bn/beta", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_11_bn/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_11_bn/moving_variance", "shape": [512]}]}, {"paths": ["group8-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_12/depthwise_kernel", "shape": [3, 3, 512, 1]}]}, {"paths": ["group9-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_12_bn/gamma", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_12_bn/beta", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_12_bn/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_12_bn/moving_variance", "shape": [512]}]}, {"paths": ["group10-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_13/depthwise_kernel", "shape": [3, 3, 1024, 1]}]}, {"paths": ["group11-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_13_bn/gamma", "shape": [1024]}, {"dtype": "float32", "name": "conv_dw_13_bn/beta", "shape": [1024]}, {"dtype": "float32", "name": "conv_dw_13_bn/moving_mean", "shape": [1024]}, {"dtype": "float32", "name": "conv_dw_13_bn/moving_variance", "shape": [1024]}]}, {"paths": ["group12-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_1_bn/gamma", "shape": [32]}, {"dtype": "float32", "name": "conv_dw_1_bn/beta", "shape": [32]}, {"dtype": "float32", "name": "conv_dw_1_bn/moving_mean", "shape": [32]}, {"dtype": "float32", "name": "conv_dw_1_bn/moving_variance", "shape": [32]}]}, {"paths": ["group13-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_2/depthwise_kernel", "shape": [3, 3, 64, 1]}]}, {"paths": ["group14-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_2_bn/gamma", "shape": [64]}, {"dtype": "float32", "name": "conv_dw_2_bn/beta", "shape": [64]}, {"dtype": "float32", "name": "conv_dw_2_bn/moving_mean", "shape": [64]}, {"dtype": "float32", "name": "conv_dw_2_bn/moving_variance", "shape": [64]}]}, {"paths": ["group15-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_3/depthwise_kernel", "shape": [3, 3, 128, 1]}]}, {"paths": ["group16-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_3_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv_dw_3_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv_dw_3_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv_dw_3_bn/moving_variance", "shape": [128]}]}, {"paths": ["group17-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_4/depthwise_kernel", "shape": [3, 3, 128, 1]}]}, {"paths": ["group18-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_4_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv_dw_4_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv_dw_4_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv_dw_4_bn/moving_variance", "shape": [128]}]}, {"paths": ["group19-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_5/depthwise_kernel", "shape": [3, 3, 256, 1]}]}, {"paths": ["group20-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_5_bn/gamma", "shape": [256]}, {"dtype": "float32", "name": "conv_dw_5_bn/beta", "shape": [256]}, {"dtype": "float32", "name": "conv_dw_5_bn/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "conv_dw_5_bn/moving_variance", "shape": [256]}]}, {"paths": ["group21-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_6/depthwise_kernel", "shape": [3, 3, 256, 1]}]}, {"paths": ["group22-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_6_bn/gamma", "shape": [256]}, {"dtype": "float32", "name": "conv_dw_6_bn/beta", "shape": [256]}, {"dtype": "float32", "name": "conv_dw_6_bn/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "conv_dw_6_bn/moving_variance", "shape": [256]}]}, {"paths": ["group23-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_7/depthwise_kernel", "shape": [3, 3, 512, 1]}]}, {"paths": ["group24-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_7_bn/gamma", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_7_bn/beta", "shape": 